export const getMeasureUnit = (code: string): string => {
  const units: Record<string, string> = {
    '0': 'шт',
    '10': 'г',
    '11': 'кг',
    '12': 'т',
    '20': 'см',
    '21': 'дм',
    '22': 'м',
    '30': 'см²',
    '31': 'дм²',
    '32': 'м²',
    '40': 'мл',
    '41': 'л',
    '42': 'м³',
    '50': 'кВт⋅ч',
    '51': 'Гкал',
    '70': 'сут',
    '71': 'ч',
    '72': 'мин',
    '73': 'с',
    '80': 'Кб',
    '81': 'Мб',
    '82': 'Гб',
    '83': 'Тб',
    '255': 'ед',
  };
  return units[code] || 'шт';
};
